# Merging Dataframes

## Using Merge function

In [1]:
import pandas as pd

In [2]:
stuff_df = pd.DataFrame({
    'Name': ['Keylly','Sally','James'],
    'Role': ['Director of HR','Course Liasion','Grader']
})
stuff_df = stuff_df.set_index('Name')

In [3]:
stuff_df

                  Role
Name
Keylly  Director of HR
Sally   Course Liasion
James           Grader

In [4]:
student_df = pd.DataFrame([
    {'Name':'James','School':'Business'},
    {'Name':'Mike','School': 'Law'},
    {'Name':'Sally','School':'Engineering'}
])
student_df = student_df.set_index('Name')

In [5]:
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [6]:
# outer join in pandas
df = pd.merge(stuff_df,student_df,how='outer',left_index=True,right_index=True)

In [7]:
df

                  Role       School
Name
James           Grader     Business
Keylly  Director of HR          NaN
Mike               NaN          Law
Sally   Course Liasion  Engineering

In [8]:
# inner join in pandas
df2 = pd.merge(stuff_df,student_df,how='inner',left_index=True,right_index=True)

In [9]:
df2

                 Role       School
Name
Sally  Course Liasion  Engineering
James          Grader     Business

In [10]:
# left join in pandas
df3 = pd.merge(stuff_df,student_df,how='left',left_index=True,right_index=True)

In [11]:
df3

                  Role       School
Name
Keylly  Director of HR          NaN
Sally   Course Liasion  Engineering
James           Grader     Business

In [12]:
# right join in pandas
df4 = pd.merge(stuff_df,student_df,how='right',left_index=True,right_index=True)

In [13]:
df4

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course Liasion  Engineering

In [14]:
student_df = student_df.reset_index()
stuff_df = stuff_df.reset_index()

### Pandas Joining without indexing

In [15]:
df5 = pd.merge(stuff_df,student_df, how='right',on='Name')

In [16]:
df5

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course Liasion  Engineering

In [17]:
df6 = pd.merge(student_df,stuff_df, how='right',on='Name')

In [18]:
df6

     Name       School            Role
0  Keylly          NaN  Director of HR
1   Sally  Engineering  Course Liasion
2   James     Business          Grader

In [19]:
staff_df1 = pd.DataFrame([
    {'Name':'Kelly','Role':'Director Of HR','Location':'State Street'},
    {'Name':'Sally','Role':'Course liasion','Location':'Washington Avenue'},
    {'Name':'James','Role':'Grader','Location':'Washington Avenue'}
])

In [20]:
student_df1 = pd.DataFrame([
    {'Name':'James','School':'Business','Location':'1024 Billiard Avenue'},
    {'Name':'Mike','School':'Law','Location':'Fraternity House #22'},
    {'Name':'Sally','School':'Engineering','Location':' 512 Wilson Crescent'}
])

In [21]:
student_df1

    Name       School              Location
0  James     Business  1024 Billiard Avenue
1   Mike          Law  Fraternity House #22
2  Sally  Engineering   512 Wilson Crescent

In [22]:
pd.merge(staff_df1,student_df1, how='left', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director Of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [23]:
pd.merge(student_df1,staff_df1,how='left', on='Name')

    Name       School            Location_x            Role         Location_y
0  James     Business  1024 Billiard Avenue          Grader  Washington Avenue
1   Mike          Law  Fraternity House #22             NaN                NaN
2  Sally  Engineering   512 Wilson Crescent  Course liasion  Washington Avenue

In [24]:
pd.merge(staff_df1,student_df1,how='outer', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director Of HR       State Street          NaN                   NaN
1  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue
3   Mike             NaN                NaN          Law  Fraternity House #22

In [25]:
pd.merge(staff_df1,student_df1,how='inner', on='Name')

    Name            Role         Location_x       School            Location_y
0  Sally  Course liasion  Washington Avenue  Engineering   512 Wilson Crescent
1  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [26]:
staff_df2 = pd.DataFrame([
    {'First Name':'Kelly','Last Name':'Desjardins','Role':'Director Of HR'},
    {'First Name':'Sally','Last Name':'Brooks','Role':'Course liasion'},
    {'First Name':'James','Last Name':'Wilde','Role':'Grader'}
])


student_df2 = pd.DataFrame([
    {'First Name':'James','Last Name':'Hammond','School':'Business'},
    {'First Name':'Mike','Last Name':'Smith','School':'Law'},
    {'First Name':'Sally','Last Name':'Brooks','School':'Engineering'}
])

In [27]:
pd.merge(staff_df2,student_df2, how='inner', on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [28]:
pd.merge(staff_df2,student_df2, how='inner', on='Last Name')

  First Name_x Last Name            Role First Name_y       School
0        Sally    Brooks  Course liasion        Sally  Engineering

In [29]:
pd.merge(student_df2,staff_df2, how='inner', on='Last Name')

  First Name_x Last Name       School First Name_y            Role
0        Sally    Brooks  Engineering        Sally  Course liasion

In [30]:
pd.merge(staff_df2,student_df2, how='right', on='Last Name')

  First Name_x Last Name            Role First Name_y       School
0          NaN   Hammond             NaN        James     Business
1          NaN     Smith             NaN         Mike          Law
2        Sally    Brooks  Course liasion        Sally  Engineering

In [31]:
pd.merge(staff_df2,student_df2, how='right', on=['Last Name','First Name'])

  First Name Last Name            Role       School
0      James   Hammond             NaN     Business
1       Mike     Smith             NaN          Law
2      Sally    Brooks  Course liasion  Engineering

In [34]:
pd.merge(stuff_df,student_df,how='right',left_index=True,right_index=True)

   Name_x            Role Name_y       School
0  Keylly  Director of HR  James     Business
1   Sally  Course Liasion   Mike          Law
2   James          Grader  Sally  Engineering

## using concat function